ci-4/app/Controllers/Barang.php

    public function create() {
        $data = [
            'Kategori' => $this->kategori->findAll(),
        ];
---
SELECT *
FROM `kategori`