ci-4/app/Models/Barang.php

SELECT *
FROM `barang`
SELECT *
FROM `barang`
WHERE `id_brg` = '19'
 LIMIT 1
---
    public function getBarang($id_brg = false){
        if($id_brg == false) {
            return $this->findAll();
        } else {
            return $this->where('id_brg',$id_brg)->first();

UPDATE `barang` SET `nama_brg` = 'THE REVE FESTIVAL 2022 - FEEL MY RHYTHM', `nama_artis` = 'RED VELVET', `harga_brg` = '30', `stok_brg` = '50', `img_brg` = 'po10.jpg', `id_kategori` = '5'
WHERE `barang`.`id_brg` IN ('20')
---
    public function updateBarang($id_brg, $data) {
        return $this->update($id_brg, $data);

DELETE FROM `barang`
WHERE `id_brg` IN ('22')
---
    public function deleteBarang($id_brg) {
        return $this->delete($id_brg);

SELECT *
FROM `barang`
JOIN `kategori` ON `kategori`.`id_kategori` = `barang`.`id_kategori`
---
    public function getAll() {
        $builder = $this->db->table('barang');
        $builder->join('kategori', 'kategori.id_kategori = barang.id_kategori');
        $query = $builder->get();