ci-4/app/Models/Kategori.php

    public function getKategori($id_kategori = false){
        if($id_kategori == false) {
            return $this->findAll();
        } else {
            return $this->where('id_kategori',$id_kategori)->first();
---
SELECT *
FROM `kategori`
SELECT *
FROM `kategori`
WHERE `id_kategori` = '5'
 LIMIT 1